/***************************************************************
*Copyright(c) 2016, Sojo
*保留所有权利
*文件名称:DeviceIO.c
*文件标识:
*创建日期： 2016年11月8日 
*摘要:	 此文件用来定义基本模块初始化源文件，现在涉及的有LED控制
*当前版本:1.0
*作者: ZFREE
*取代版本:
*作者:
*完成时间:
************************************************************/
#include "DeviceIO.h"
#include "LPC17xx.h"


/**************************************************
 *函数名： Led1On()
 *形参： void
 *返回值：void
 *功能：点亮LED1
 *调用函数：null
 *引用外部变量：null
 ************************************************/
void Led1On(void)
{
  LPC_GPIO0->FIOSET |= 	1<<LED1_BIT;
}
/**************************************************
 *函数名： Led1Off()
 *形参： void
 *返回值：void
 *功能：熄灭LED1
 *调用函数：null
 *引用外部变量：null
 ************************************************/
 void Led1Off(void)
{
  LPC_GPIO0->FIOCLR |= 1<<LED1_BIT;
}


/**************************************************
 *函数名： Led2On()
 *形参： void
 *返回值：void
 *功能：点亮LED2
 *调用函数：null
 *引用外部变量：null
 ***********************************************/
  void Led2On(void)
{
  //LPC_GPIO3->FIOSET |= 	1<<LED2_BIT;
  SET_BIT(LPC_GPIO3->FIOSET, LED2_BIT)
}
/**************************************************
 *函数名： Led2Off()
 *形参： void
 *返回值：void
 *功能：熄灭LED2
 *调用函数：null
 *引用外部变量：null
 ************************************************/
 void Led2Off(void)
{
  //LPC_GPIO3->FIOSET &= 	~(1<<LED2_BIT);
  SET_BIT(LPC_GPIO3->FIOCLR, LED2_BIT);
}

/**************************************************
 *函数名： Led1Set()
 *形参： uint8_t state 0-熄灭 1-亮
 *返回值：void
 *功能：根据条件设置灯的状态
 *调用函数：null
 *引用外部变量：null	8105-8118 = 13		80740-	 80870 =  130
 ************************************************/
 void Led1Set(uint8_t state)
{
	uint32_t data = 0;
	data =  LPC_GPIO0->FIOPIN;//获取当前状态

	LPC_GPIO0->FIOPIN =  (data& ~(1<<LED1_BIT)) | ((uint32_t)(state&0x01)<<LED1_BIT);
}
/**************************************************
 *函数名： Led1Set()
 *形参： uint8_t state 0-熄灭 1-亮
 *返回值：void
 *功能：根据条件设置灯的状态
 *调用函数：null
 *引用外部变量：null	  8161-	 8175 = 14	 00081220-	 81360= 140
 ************************************************/
void Led2Set(uint8_t state)
{
  (state) ? (LPC_GPIO3->FIOSET |= 1<<LED2_BIT) : (LPC_GPIO3->FIOCLR |= 1<<LED2_BIT);
}

/**************************************************
 *函数名： LedInit()
 *形参： void
 *返回值：void
 *功能：初始化LED
 *调用函数：
 *引用外部变量：
 ************************************************/
void LedInit(void)
{
   
  LPC_GPIO0->FIODIR |= 0x60000000; //LED1 P0_29初始化 为输出,作为USB-D口，P0_29,P0_30需要同时初始化为输出            
  LPC_GPIO0->FIOPIN |=  1<<LED1_BIT; //置为高电平	 0x20000000
  
  LPC_GPIO3->FIODIR |=  1<<LED2_BIT; // LED2 P3_25 初始化为输出 0x02000000
  LPC_GPIO0->FIOPIN |=  1<<LED2_BIT; //置为高电平	 0x02000000

}

